% =========================================================
% Octave에서 그래프 창 열고 기본 설정
% =========================================================
% figure      : 그래프 창 열기
% hold on     : 여러 개의 그래프를 한 창에 겹쳐서 그릴 수 있도록 설정
% grid on     : 격자선 표시
% axis equal  : x축과 y축의 비율을 동일하게 맞춤
% xlim, ylim  : x축과 y축의 범위 설정

% =========================================================
% 간단한 2차원 그래프 그리기
% =========================================================
% plot(x, y, '[색상][마커][선스타일]', 'LineWidth', 굵기, 'MarkerSize', 크기)
%  : x좌표와 y좌표를 연결하여 선을 그림

% ---------------------------------------------------------
% 색상옵션 (Color)
% ---------------------------------------------------------
% 'r' : 빨강(red)       | 'm' : 자홍(magenta)
% 'g' : 초록(green)     | 'y' : 노랑(yellow)
% 'b' : 파랑(blue)      | 'k' : 검정(black)
% 'c' : 청록(cyan)      | 'w' : 흰색(white)

% 예시:
% plot(x, y, 'r');
clc;clear;close all;

figure;
hold on;
grid on;
axis equal;
xlim([-3,10]);
ylim([-3,10]);
x = linspace(0, 2*pi, 100);
y = sin(x);

plot(x,y, 'b-', 'LineWidth', 2);
xlabel('X')
ylabel('Y')
title('Sin(x)')
